cases/artigo_mestrado/on-caso-1.2/_grid/P2000_d1e19_neohooke/fluid/system/fvOptions
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}

// on-caso-1 - zona porosa DarcyForchheimer no lid distal (z=[30, 30.5]).
//
// Modelo: a extremidade distal do espaco subaracnoideo perioptico (proximo
// a lamina cribrosa) drena LCR via vilositosidades aracnoideas / vias
// linfaticas perineurais. A resistencia desse percurso e' representada como
// uma zona porosa Darcy-Forchheimer:
//
//   grad(p)/rho = -nu * d * U     (creeping flow, Forchheimer f=0)
//
// onde d [m^-2] e' o coeficiente de resistencia viscosa de Darcy.
//
// Calibracao do d inicial (1e15 m^-2):
//   Area anular do outlet:    A = pi(R_sas^2 - R_pia^2) = pi(2.35^2-1.55^2)e-6
//                               ~= 9.80e-6 m^2
//   Espessura do lid:         L = 0.5e-3 m
//   nu (CSF water-like):      nu = 1e-6 m^2/s
//   Q fisiologico ONSAS:      ~3e-11 m^3/s (~0.5% turnover cerebral CSF)
//   U = Q/A                   ~= 3e-6 m/s
//   Δp_kin_alvo                = p_inlet = 1.333 m^2/s^2 (~ 1333 Pa)
//                                (todo o gradiente de pressao do sistema
//                                 cai atraves do lid Darcy, ja que o bulk
//                                 SAS tem perda viscosa desprezivel)
//   Equacao Darcy kinematic:   Δp_kin = nu * d * L * U
//                              1.333 = 1e-6 * d * 0.5e-3 * 3e-6
//                              d     = 1.333 / 1.5e-15
//                                    ~= 8.9e14 m^-2  ~ 1e15 (arredondado)
//
// Regimes via d (mantendo geometria + BCs):
//   d ~ 1e13     compartimentalizacao MINIMA (lid quase aberto, U alto)
//   d ~ 1e15     SAUDAVEL  (compartimentalizacao parcial fisiologica)
//   d ~ 1e17     IIH-like  (compartimentalizacao quase total, U ~ 0)
//   d -> inf     equivalente ao cul-de-sac fechado (= on-fsi-2)
//   active false equivalente ao outlet livre (= on-fsi-2-openSAS)
//
// NOTA: a primeira calibracao tentou d=1e12 mas isso correspondia a
// resistencia desprezivel (U ~ 2.7 m/s, irrealista) e desestabilizou o
// acoplamento IQN-ILS. d=1e15 e' o ponto de partida fisiologico.
//
// IMPORTANTE: requer libsolids4FoamModels.so com patch fvOptions.
//   O upstream solids4foam v2512/ESI desativa fvOptions em pimpleFluid.esi.C
//   (linhas marcadas como "// fvOptions not implemented yet"), o que faz a
//   Darcy ser ignorada (U_max ~ 20 m/s, Re ~ 40000, regime Bernoulli).
//   O Dockerfile aplica o patch (sed em pimpleFluid.esi.C) que adiciona
//   fvOptions(U) ao tUEqn momentum. Sem o patch, qualquer valor de d e'
//   numericamente inerte. Validacao do patch (sweep d=1e13/1e15/1e17 no
//   on-caso-1.2 - cases/on-caso-1.2/_sweep/):
//
//     d (m^-2)   U_pp_max         Q_drenage (m^3/s)   Regime
//     1e13       1.19e-4 m/s      9.96e-10            microdrenagem aberta
//     1e15       1.19e-6 m/s      9.96e-12            saudavel (~ fisiologico)
//     1e17       1.19e-8 m/s      9.96e-14            IIH/SANS-like (compart.)
//
//   Escalamento exato 100x:100x confirma Darcy puro aplicado ao momentum.
//
// NOTA sobre pressao: como p_inlet (1333 Pa) e p_outlet (0 Pa) sao
//   fixedValue, a queda total dp = 1333 Pa e' compartilhada entre SAS e
//   peri_porous numa proporcao geometrica (Δp_lid ~ 444 Pa = 33%, Δp_SAS ~
//   0 Pa). Para que ICP varie com d (compartimentalizacao via pressao),
//   trocar inlet para fluxo prescrito (codedFixedValue ou flowRateInletVel.).
//   No setup atual, a compartimentalizacao se manifesta no FLUXO Q (-> 0
//   quando d -> inf), o que matches diretamente o mecanismo SANS de
//   obstrucao das vilositosidades aracnoideas perineurais.
//
// Referencia: cases/old/eye-fsi-tc0/fluid/system/fvOptions (TM/vitreous Darcy).

peri_porous
{
    type            explicitPorositySource;
    active          true;

    explicitPorositySourceCoeffs
    {
        selectionMode   cellZone;
        cellZone        peri_porous;

        type            DarcyForchheimer;

        DarcyForchheimerCoeffs
        {
            d   d [0 -2 0 0 0 0 0] (1e+19 1e+19 1e+19);
            f   f [0 -1 0 0 0 0 0] (0 0 0);

            coordinateSystem
            {
                type    cartesian;
                origin  (0 0 0);
                coordinateRotation { type axesRotation; e1 (1 0 0); e2 (0 1 0); }
            }
        }
    }
}
